TensorDT/uCOS-II_MC9S12DG256/Source/MC9S12DG256/sw_traps.c
//*********************************************************************
//
//  File name:  sw_traps.c
//
//  Purpose:    Software Traps module
//
//  Target:     CPU 2.0
//
//  Revisions:
//   ##  dd mmm yyyy  who  description
//    1  28 Oct 2020  GPM  Initial revision.
//
//  Notes:
//  (c) 2020 Tensor Drilling Technologies, Inc. All rights reserved.
//  (p) 2020 Tensor Drilling Technologies, Inc. All rights reserved.
//
//  Tensor Drilling Technologies
//  2418 North Frazier St., Suite 100
//  Conroe, TX 77303
//*********************************************************************

//--------------------------- Included Files --------------------------
#include "mc9s12dg256_banking.h"

//-------------------------- Type Definitions -------------------------
// none

//------------------------ Constant Definitions -----------------------
// none

//------------------------------- Macros ------------------------------
// none

//-------------------------- Module Variables -------------------------
// none

//------------------------------ Functions ----------------------------
_NEAR void SoftwareTrap64 (void) {for(;;);}
_NEAR void SoftwareTrap63 (void) {for(;;);}
_NEAR void SoftwareTrap62 (void) {for(;;);}
_NEAR void SoftwareTrap61 (void) {for(;;);}
_NEAR void SoftwareTrap60 (void) {for(;;);}
_NEAR void SoftwareTrap59 (void) {for(;;);}
_NEAR void SoftwareTrap58 (void) {for(;;);}
_NEAR void SoftwareTrap57 (void) {for(;;);}
_NEAR void SoftwareTrap56 (void) {for(;;);}
_NEAR void SoftwareTrap55 (void) {for(;;);}
_NEAR void SoftwareTrap54 (void) {for(;;);}
_NEAR void SoftwareTrap53 (void) {for(;;);}
_NEAR void SoftwareTrap52 (void) {for(;;);}
_NEAR void SoftwareTrap51 (void) {for(;;);}
_NEAR void SoftwareTrap50 (void) {for(;;);}
_NEAR void SoftwareTrap49 (void) {for(;;);}
_NEAR void SoftwareTrap48 (void) {for(;;);}
_NEAR void SoftwareTrap47 (void) {for(;;);}
_NEAR void SoftwareTrap46 (void) {for(;;);}
_NEAR void SoftwareTrap45 (void) {for(;;);}
_NEAR void SoftwareTrap44 (void) {for(;;);}
_NEAR void SoftwareTrap43 (void) {for(;;);}
_NEAR void SoftwareTrap42 (void) {for(;;);}
_NEAR void SoftwareTrap41 (void) {for(;;);}
_NEAR void SoftwareTrap40 (void) {for(;;);}
_NEAR void SoftwareTrap39 (void) {for(;;);}
_NEAR void SoftwareTrap38 (void) {for(;;);}
_NEAR void SoftwareTrap37 (void) {for(;;);}
_NEAR void SoftwareTrap36 (void) {for(;;);}
_NEAR void SoftwareTrap35 (void) {for(;;);}
_NEAR void SoftwareTrap34 (void) {for(;;);}
_NEAR void SoftwareTrap33 (void) {for(;;);}
_NEAR void SoftwareTrap32 (void) {for(;;);}
_NEAR void SoftwareTrap31 (void) {for(;;);}
_NEAR void SoftwareTrap30 (void) {for(;;);}
_NEAR void SoftwareTrap29 (void) {for(;;);}
_NEAR void SoftwareTrap28 (void) {for(;;);}
_NEAR void SoftwareTrap27 (void) {for(;;);}
_NEAR void SoftwareTrap26 (void) {for(;;);}
_NEAR void SoftwareTrap25 (void) {for(;;);}
_NEAR void SoftwareTrap24 (void) {for(;;);}
_NEAR void SoftwareTrap23 (void) {for(;;);}
_NEAR void SoftwareTrap22 (void) {for(;;);}
_NEAR void SoftwareTrap21 (void) {for(;;);}
_NEAR void SoftwareTrap20 (void) {for(;;);}
_NEAR void SoftwareTrap19 (void) {for(;;);}
_NEAR void SoftwareTrap18 (void) {for(;;);}
_NEAR void SoftwareTrap17 (void) {for(;;);}
_NEAR void SoftwareTrap16 (void) {for(;;);}
_NEAR void SoftwareTrap15 (void) {for(;;);}
_NEAR void SoftwareTrap14 (void) {for(;;);}
_NEAR void SoftwareTrap13 (void) {for(;;);}
_NEAR void SoftwareTrap12 (void) {for(;;);}
_NEAR void SoftwareTrap11 (void) {for(;;);}
_NEAR void SoftwareTrap10 (void) {for(;;);}
_NEAR void SoftwareTrap09 (void) {for(;;);}
_NEAR void SoftwareTrap08 (void) {for(;;);}
_NEAR void SoftwareTrap07 (void) {for(;;);}
_NEAR void SoftwareTrap06 (void) {for(;;);}
_NEAR void SoftwareTrap05 (void) {for(;;);}
_NEAR void SoftwareTrap04 (void) {for(;;);}
_NEAR void SoftwareTrap03 (void) {for(;;);}
_NEAR void SoftwareTrap02 (void) {for(;;);}
_NEAR void SoftwareTrap01 (void) {for(;;);}
